Tekla Open API Reference for Tekla Structures 2025
Distance.Equals Method (Object)
 Indicates whether the current instance and the specified object are equal.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
The object to be compared with the current object.
Return Value
Type: Boolean
True if the specified object and the current instance are of the same type and represent the same value; otherwise, false.
See Also
Reference
Distance Structure
Equals Overload
Tekla.Structures.Datatype Namespace